spec/fixtures/requests/deactivate/unsigned_soap.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/WholesaleSubscriptionModify/v1/ModifySubscriptionEnvelope.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:expireSubscription>
<sub:mdn>5555555555</sub:mdn>
</sub:expireSubscription></soapenv:Body>
</soapenv:Envelope>