spec/fixtures/requests/change/unsigned_soap.xml

<soapenv:Envelope 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/wholesaleChangeServicePlans/v3/wholesaleChangeServicePlansV3.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2013020701</v2:applicationId>
<v2:applicationUserId>MOBILENET</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:wholesaleChangeServicePlansV3>
<sub:mdn>5555555555</sub:mdn>
<sub:pricePlan>
<sub:serviceCode>TEST_PLAN</sub:serviceCode>
</sub:pricePlan>
<sub:serviceList>
<sub:serviceRecord>
<sub:serviceCode>NEW_CODE</sub:serviceCode>
</sub:serviceRecord>
</sub:serviceList>
<sub:oldServiceList>
<sub:serviceRecord>
<sub:serviceCode>REMOVE_CODE</sub:serviceCode>
</sub:serviceRecord>
</sub:oldServiceList>
</sub:wholesaleChangeServicePlansV3>
</soapenv:Body>
</soapenv:Envelope>